Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Comment>АПК:93 одинаковое представление и для объекта и для списка</Comment>
			<BasedOn>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.ОприходованиеЗапасов</xr:Item>
				<xr:Item>Document.СборкаЗапасов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписыватьНовыеЦеныПоверхУстановленных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьДействующуюЦену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьЗависимыеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНедействительныеХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьОтклонениеЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьХарактеристикамБезЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНовуюЦену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьНаценку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетИзВидаЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаСтарая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ВидыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыЦен</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>Валюта цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Comment>Истина - цена включает НДС, ложь - не включает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Comment>Порядок округления</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Comment>Истина, то при порядке округления "5" 0.01 будет округлена до 5, ложь - округление по арифметическим правилам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматЦены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВидаЦен</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВидовЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеныАктуальны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокСлужебный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПсихологическоеОкругление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорогСрабатыванияПриУменьшении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорогСрабатыванияПриУвеличении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеСхемыКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОтображения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокКолонок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляРасчетаВРасширении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьИзОснования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесколькоВалютДляЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦеновыеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйВидЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПравилаОкругленияЦены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НижняяГраницаДиапазонаЦен</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочностьОкругления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПсихологическоеОкругление</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПорогиСрабатывания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорогСрабатыванияПриУвеличении</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорогСрабатыванияПриУменьшении</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/УстановкаЦенНоменклатуры/Forms/ФормаИзмененияЦен/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИзменитьОднуКолонку = Истина;

	Параметры.Свойство("ВидРасчета", ВариантИзменения);
	
	КэшЗначений = Неопределено;
	Параметры.Свойство("КэшЗначений", КэшЗначений);
	
	Параметры.Свойство("ДатаДокумента", ДатаДокумента);
    Параметры.Свойство("ИдентификаторыЦен", ИдентификаторыЦен);

	Если ВариантИзменения = "Сумма" Тогда

		Заголовок = НСтр("ru ='Изменить цены на сумму'"); 
		
	ИначеЕсли ВариантИзменения = "УстановитьЦену" Тогда

		Заголовок = НСтр("ru ='Установить цену характеристикам'"); 

	ИначеЕсли ВариантИзменения = "Процент" Тогда

		Заголовок = НСтр("ru ='Изменить цены на процент'");

	ИначеЕсли ВариантИзменения = "Округление" Тогда

		Заголовок = НСтр("ru ='Округление'");

	ИначеЕсли ВариантИзменения = "Очистить" Тогда

		Заголовок = НСтр("ru ='Очистить'");

	ИначеЕсли ВариантИзменения = "Формула" Тогда

		Заголовок = НСтр("ru ='Изменить цены по формуле'");

	ИначеЕсли ВариантИзменения = "Валюта" Тогда

		Заголовок = НСтр("ru ='Изменить валюту'");

	КонецЕсли;

	Элементы.Страницы.ТекущаяСтраница = Элементы["Страница" + ВариантИзменения];

	Для Каждого ЭлементПеречисления Из Параметры.КэшЗначений.ВыбранныеВидыЦен Цикл

		ДобавитьВидЦеныВСписокВыбора(ЭлементПеречисления);

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	ИсторияФормул = Настройки.Получить("ИсторияФормул");
	Если ИсторияФормул = Неопределено Тогда

		Возврат;

	КонецЕсли;

	ИсторияИспользованияФормул = СтрРазделить(ИсторияФормул, "~");
	Для Каждого ЭлементМассива Из ИсторияИспользованияФормул Цикл

		Если Не ЗначениеЗаполнено(ЭлементМассива) Тогда

			Продолжить;

		КонецЕсли;

		Элементы.Формула.СписокВыбора.Добавить(ЭлементМассива);

	КонецЦикла;

	Если Элементы.Формула.СписокВыбора.Количество() > 0 Тогда

		Элементы.Формула.КнопкаВыпадающегоСписка = Истина;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПересчитатьПоКурсуПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элементы.ПересчитатьПоКурсу, "Нажатие");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОднуКолонкуПриИзменении(Элемент)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТекущийВидЦен", "Видимость",
		ИзменитьОднуКолонку);

КонецПроцедуры

&НаКлиенте
Процедура ФормулаОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьКонструкторФормулы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)

	Если ИзменитьОднуКолонку И Не ЗначениеЗаполнено(ТекущийВидЦен) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Выберите вид цены'");
		Сообщение.Поле = "ТекущийВидЦен";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("ВыборПроизведен"				, Истина);
	Результат.Вставить("ЗаполнятьПоТекущемуВидуЦен"		, ?(ИзменитьОднуКолонку, 0, 1));
	Результат.Вставить("ИдентификаторТекущегоВидаЦен"	, ТекущийВидЦен);
	Результат.Вставить("ВариантИзменения"				, ВариантИзменения);
	Результат.Вставить("ОбластьПрименения"				, ОбластьПрименения);
	Результат.Вставить("ПсихологическоеОкругление"		, ПсихологическоеОкругление);

	Если ВариантИзменения = "Сумма" Тогда

		Результат.Вставить("Сумма", Сумма); 
		
	ИначеЕсли ВариантИзменения = "УстановитьЦену" Тогда

		Результат.Вставить("УстановитьЦену", Цена);

	ИначеЕсли ВариантИзменения = "Процент" Тогда

		Результат.Вставить("Процент", Процент);

	ИначеЕсли ВариантИзменения = "Округление" Тогда

		Результат.Вставить("ОкруглениеПорядок", ОкруглениеПорядок);
		Результат.Вставить("ОкруглениеВБольшуюСторону", ОкруглениеВБольшуюСторону);

	ИначеЕсли ВариантИзменения = "Формула" Тогда

		Результат.Вставить("Формула", Формула);
		ВнестиФормулуВИсториюИспользований(Формула);
		
	ИначеЕсли ВариантИзменения = "Валюта" Тогда
		
		Если Не ЗначениеЗаполнено(Валюта) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Выберите валюту'");
			Сообщение.Поле = "Валюта";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
		Результат.Вставить("ПересчитатьПоКурсу", ПересчитатьПоКурсу);
		Результат.Вставить("ДатаКурса", ДатаДокумента);
		Результат.Вставить("Валюта", Валюта);
		
	КонецЕсли;

	Закрыть(Результат);

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)

	Результат = Новый Структура;
	Результат.Вставить("ВыборПроизведен", Ложь);

	Закрыть(Результат);

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьФормулу(Команда)

	ОткрытьКонструкторФормулы();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьКонструкторФормулы()
	ПараметрыФормулы = Новый Структура;
	ПараметрыФормулы.Вставить("Формула", Формула);
	ПараметрыФормулы.Вставить("ЭтоФормированиеЦен", Истина);

	ОписаниеОповещения = Новый ОписаниеОповещения("КонструкторФормулЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВидыЦен.Форма.КонструкторФормул", ПараметрыФормулы, Элементы.Формула, , , ,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура КонструкторФормулЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Результат = КодВозвратаДиалога.Да Тогда

		Результат.Свойство("Формула", Формула);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВнестиФормулуВИсториюИспользований(Формула)

	Если ПустаяСтрока(Формула) Тогда

		Возврат;

	КонецЕсли;

	Если ПустаяСтрока(ИсторияФормул) Тогда

		ИсторияФормул = "~~~~";

	КонецЕсли;

	МассивФормул = СтрРазделить(ИсторияФормул, "~", Истина);

	ИндексЭтойФормулы = МассивФормул.Найти(СокрЛП(Формула));
	Если ИндексЭтойФормулы = Неопределено Тогда

		ИндексЭтойФормулы = 4;

	КонецЕсли;

	КопияМассиваФормул = Новый Массив(5);
	КопияМассиваФормул[0] = СокрЛП(Формула);

	СтандартноеПриращение = 1;
	Для ИндексМассива = 0 По 4 Цикл

		Если ИндексМассива = ИндексЭтойФормулы Тогда

			СтандартноеПриращение = 0;
			Продолжить;

		КонецЕсли;

		СохраненнаяФормула = СокрЛП(Строка(МассивФормул[ИндексМассива]));
		КопияМассиваФормул[ИндексМассива + СтандартноеПриращение] = СохраненнаяФормула;

	КонецЦикла;

	ИсторияФормул = СтрСоединить(КопияМассиваФормул, "~");

КонецПроцедуры

&НаСервере
Процедура ДобавитьВидЦеныВСписокВыбора(Элемент)

	Если Элементы.ТекущийВидЦен.СписокВыбора.НайтиПоЗначению(Элемент.Ключ.ИдентификаторФормул) = Неопределено Тогда

		Если ВариантИзменения = "Валюта" Тогда
			Если Элемент.Ключ.НесколькоВалютДляЦен Тогда
				
				Элементы.ТекущийВидЦен.СписокВыбора.Добавить(Элемент.Ключ.ИдентификаторФормул,
					Элемент.Ключ.Наименование);
					
			КонецЕсли;
		Иначе
			Элементы.ТекущийВидЦен.СписокВыбора.Добавить(Элемент.Ключ.ИдентификаторФормул, Элемент.Ключ.Наименование);
		КонецЕсли;

	КонецЕсли;

	Если Элемент.Значение.Количество() > 0 Тогда

		Для Каждого ПодчиненныйЭлемент Из Элемент.Значение Цикл

			ДобавитьВидЦеныВСписокВыбора(ПодчиненныйЭлемент);

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ТекущийВидЦенПриИзмененииНаСервере()
	
	Если ИдентификаторыЦен <> Неопределено Тогда
		ИдентификаторыЦен.Свойство(ТекущийВидЦен, Цена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийВидЦенПриИзменении(Элемент) 
	
	Если ВариантИзменения = "УстановитьЦену" Тогда
		ТекущийВидЦенПриИзмененииНаСервере();
	КонецЕсли;   
	
КонецПроцедуры   

#КонецОбласти
